; domain
(define (domain zeno-travel)
(:requirements :typing :fluents)
(:types aircraft person city - object)
(:predicates (at ?x - (either person aircraft) ?c - city)
             (in ?p - person ?a - aircraft))
(:functions (fuel ?a - aircraft)
            (distance ?c1 - city ?c2 - city)
            (slow-burn ?a - aircraft)
            (fast-burn ?a - aircraft)
            (capacity ?a - aircraft)
            (total-fuel-used)
	    (onboard ?a - aircraft)
            (zoom-limit ?a - aircraft)
            )


(:action board
 :parameters (?p - person ?a - aircraft ?c - city)
 :precondition (and (at ?p ?c)
                 (at ?a ?c))
 :effect (and (not (at ?p ?c))
              (in ?p ?a)
		(increase (onboard ?a) 1)))


(:action debark
 :parameters (?p - person ?a - aircraft ?c - city)
 :precondition (and (in ?p ?a)
                 (at ?a ?c))
 :effect (and (not (in ?p ?a))
              (at ?p ?c)
		(decrease (onboard ?a) 1)))

(:action fly 
 :parameters (?a - aircraft ?c1 ?c2 - city)
 :precondition (and (at ?a ?c1)
                 (>= (fuel ?a) 
                         (* (distance ?c1 ?c2) (slow-burn ?a))))
 :effect (and (not (at ?a ?c1))
              (at ?a ?c2)
              (increase (total-fuel-used)
                         (* (distance ?c1 ?c2) (slow-burn ?a)))
              (decrease (fuel ?a) 
                         (* (distance ?c1 ?c2) (slow-burn ?a)))))
                                  
(:action zoom
 :parameters (?a - aircraft ?c1 ?c2 - city)
 :precondition (and (at ?a ?c1)
                 (>= (fuel ?a) 
                         (* (distance ?c1 ?c2) (fast-burn ?a)))
                 (<= (onboard ?a) (zoom-limit ?a)))
 :effect (and (not (at ?a ?c1))
              (at ?a ?c2)
              (increase (total-fuel-used)
                         (* (distance ?c1 ?c2) (fast-burn ?a)))
              (decrease (fuel ?a) 
                         (* (distance ?c1 ?c2) (fast-burn ?a)))
	)
) 

(:action refuel	
 :parameters (?a - aircraft ?c - city)
 :precondition (and (> (capacity ?a) (fuel ?a))
               (at ?a ?c)
		)
 :effect (and (assign (fuel ?a) (capacity ?a)))
)


)

; problem
(define (problem ZTRAVEL-4-3)
(:domain zeno-travel)
(:objects
	plane1 - aircraft
	plane2 - aircraft
	plane3 - aircraft
	plane4 - aircraft
	person1 - person
	person2 - person
	person3 - person
	city0 - city
	city1 - city
	city2 - city
	city3 - city
	city4 - city
	city5 - city
	city6 - city
	city7 - city
	city8 - city
	city9 - city
	)
(:init
	(at plane1 city9)
	(= (capacity plane1) 10566)
	(= (fuel plane1) 547)
	(= (slow-burn plane1) 4)
	(= (fast-burn plane1) 10)
	(= (onboard plane1) 0)
	(= (zoom-limit plane1) 10)
	(at plane2 city0)
	(= (capacity plane2) 7751)
	(= (fuel plane2) 2070)
	(= (slow-burn plane2) 3)
	(= (fast-burn plane2) 8)
	(= (onboard plane2) 0)
	(= (zoom-limit plane2) 3)
	(at plane3 city5)
	(= (capacity plane3) 8903)
	(= (fuel plane3) 3267)
	(= (slow-burn plane3) 4)
	(= (fast-burn plane3) 14)
	(= (onboard plane3) 0)
	(= (zoom-limit plane3) 9)
	(at plane4 city9)
	(= (capacity plane4) 12336)
	(= (fuel plane4) 3283)
	(= (slow-burn plane4) 4)
	(= (fast-burn plane4) 14)
	(= (onboard plane4) 0)
	(= (zoom-limit plane4) 8)
	(at person1 city2)
	(at person2 city7)
	(at person3 city3)
	(= (distance city0 city0) 0)
	(= (distance city0 city1) 862)
	(= (distance city0 city2) 631)
	(= (distance city0 city3) 548)
	(= (distance city0 city4) 522)
	(= (distance city0 city5) 748)
	(= (distance city0 city6) 900)
	(= (distance city0 city7) 718)
	(= (distance city0 city8) 977)
	(= (distance city0 city9) 661)
	(= (distance city1 city0) 862)
	(= (distance city1 city1) 0)
	(= (distance city1 city2) 996)
	(= (distance city1 city3) 623)
	(= (distance city1 city4) 948)
	(= (distance city1 city5) 634)
	(= (distance city1 city6) 876)
	(= (distance city1 city7) 878)
	(= (distance city1 city8) 801)
	(= (distance city1 city9) 760)
	(= (distance city2 city0) 631)
	(= (distance city2 city1) 996)
	(= (distance city2 city2) 0)
	(= (distance city2 city3) 939)
	(= (distance city2 city4) 742)
	(= (distance city2 city5) 936)
	(= (distance city2 city6) 719)
	(= (distance city2 city7) 595)
	(= (distance city2 city8) 881)
	(= (distance city2 city9) 861)
	(= (distance city3 city0) 548)
	(= (distance city3 city1) 623)
	(= (distance city3 city2) 939)
	(= (distance city3 city3) 0)
	(= (distance city3 city4) 742)
	(= (distance city3 city5) 849)
	(= (distance city3 city6) 657)
	(= (distance city3 city7) 821)
	(= (distance city3 city8) 791)
	(= (distance city3 city9) 717)
	(= (distance city4 city0) 522)
	(= (distance city4 city1) 948)
	(= (distance city4 city2) 742)
	(= (distance city4 city3) 742)
	(= (distance city4 city4) 0)
	(= (distance city4 city5) 514)
	(= (distance city4 city6) 653)
	(= (distance city4 city7) 848)
	(= (distance city4 city8) 562)
	(= (distance city4 city9) 676)
	(= (distance city5 city0) 748)
	(= (distance city5 city1) 634)
	(= (distance city5 city2) 936)
	(= (distance city5 city3) 849)
	(= (distance city5 city4) 514)
	(= (distance city5 city5) 0)
	(= (distance city5 city6) 596)
	(= (distance city5 city7) 962)
	(= (distance city5 city8) 894)
	(= (distance city5 city9) 574)
	(= (distance city6 city0) 900)
	(= (distance city6 city1) 876)
	(= (distance city6 city2) 719)
	(= (distance city6 city3) 657)
	(= (distance city6 city4) 653)
	(= (distance city6 city5) 596)
	(= (distance city6 city6) 0)
	(= (distance city6 city7) 623)
	(= (distance city6 city8) 891)
	(= (distance city6 city9) 698)
	(= (distance city7 city0) 718)
	(= (distance city7 city1) 878)
	(= (distance city7 city2) 595)
	(= (distance city7 city3) 821)
	(= (distance city7 city4) 848)
	(= (distance city7 city5) 962)
	(= (distance city7 city6) 623)
	(= (distance city7 city7) 0)
	(= (distance city7 city8) 572)
	(= (distance city7 city9) 525)
	(= (distance city8 city0) 977)
	(= (distance city8 city1) 801)
	(= (distance city8 city2) 881)
	(= (distance city8 city3) 791)
	(= (distance city8 city4) 562)
	(= (distance city8 city5) 894)
	(= (distance city8 city6) 891)
	(= (distance city8 city7) 572)
	(= (distance city8 city8) 0)
	(= (distance city8 city9) 574)
	(= (distance city9 city0) 661)
	(= (distance city9 city1) 760)
	(= (distance city9 city2) 861)
	(= (distance city9 city3) 717)
	(= (distance city9 city4) 676)
	(= (distance city9 city5) 574)
	(= (distance city9 city6) 698)
	(= (distance city9 city7) 525)
	(= (distance city9 city8) 574)
	(= (distance city9 city9) 0)
	(= (total-fuel-used) 0)
)
(:goal (and
	(at plane1 city6)
	(at person1 city3)
	(at person2 city2)
	(at person3 city5)
	))

(:metric minimize (+ (* 3 (total-time))  (* 5 (total-fuel-used))))
)

; plan
1. (refuel plane4 city9)
   changed: (fuel plane4) from 3283 to 12336
   goals met: 0 of 4
2. (refuel plane1 city9)
   changed: (fuel plane1) from 547 to 10566
   goals met: 0 of 4
3. (fly plane4 city9 city3)
   deleted: (at plane4 city9)
   added: (at plane4 city3)
   changed: (total-fuel-used) from 0 to 2868, (fuel plane4) from 12336 to 9468
   goals met: 0 of 4
4. (fly plane1 city9 city6)
   deleted: (at plane1 city9)
   added: (at plane1 city6)
   changed: (total-fuel-used) from 2868 to 5660, (fuel plane1) from 10566 to 7774
   goals met: 1 of 4
5. (board person3 plane4 city3)
   deleted: (at person3 city3)
   added: (in person3 plane4)
   changed: (onboard plane4) from 0 to 1
   goals met: 1 of 4
6. (fly plane4 city3 city2)
   deleted: (at plane4 city3)
   added: (at plane4 city2)
   changed: (total-fuel-used) from 5660 to 9416, (fuel plane4) from 9468 to 5712
   goals met: 1 of 4
7. (board person1 plane4 city2)
   deleted: (at person1 city2)
   added: (in person1 plane4)
   changed: (onboard plane4) from 1 to 2
   goals met: 1 of 4
8. (fly plane4 city2 city3)
   deleted: (at plane4 city2)
   added: (at plane4 city3)
   changed: (total-fuel-used) from 9416 to 13172, (fuel plane4) from 5712 to 1956
   goals met: 1 of 4
9. (debark person1 plane4 city3)
   deleted: (in person1 plane4)
   added: (at person1 city3)
   changed: (onboard plane4) from 2 to 1
   goals met: 2 of 4
10. (refuel plane4 city3)
   changed: (fuel plane4) from 1956 to 12336
   goals met: 2 of 4
11. (fly plane4 city3 city5)
   deleted: (at plane4 city3)
   added: (at plane4 city5)
   changed: (total-fuel-used) from 13172 to 16568, (fuel plane4) from 12336 to 8940
   goals met: 2 of 4
12. (debark person3 plane4 city5)
   deleted: (in person3 plane4)
   added: (at person3 city5)
   changed: (onboard plane4) from 1 to 0
   goals met: 3 of 4
13. (fly plane4 city5 city7)
   deleted: (at plane4 city5)
   added: (at plane4 city7)
   changed: (total-fuel-used) from 16568 to 20416, (fuel plane4) from 8940 to 5092
   goals met: 3 of 4
14. (board person2 plane4 city7)
   deleted: (at person2 city7)
   added: (in person2 plane4)
   changed: (onboard plane4) from 0 to 1
   goals met: 3 of 4
15. (fly plane4 city7 city2)
   deleted: (at plane4 city7)
   added: (at plane4 city2)
   changed: (total-fuel-used) from 20416 to 22796, (fuel plane4) from 5092 to 2712
   goals met: 3 of 4
16. (debark person2 plane4 city2)
   deleted: (in person2 plane4)
   added: (at person2 city2)
   changed: (onboard plane4) from 1 to 0
   goals met: 4 of 4
